src/DataProcessors/УстановкаВремениВключенияОтключенияРегламентныхЗаданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>УстановкаВремениВключенияОтключенияРегламентныхЗаданий</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Отключить</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Включить</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПолныйСписок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДобавитьЗапись</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РегламентноеЗадание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РегламентныеЗадания</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Используется</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отключить</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Включить</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>АктивныеЗаписи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РегламентноеЗадание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РегламентныеЗадания</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОтключения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВключения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АвторЗаписи</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отключено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Включено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/ДанныеОВремениВключенияОтключенияРегламентныхЗаданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ДанныеОВремениВключенияОтключенияРегламентныхЗаданий</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АвторЗаписи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отключено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Включено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>РегламентноеЗадание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегламентныеЗадания</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаОтключения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаВключения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/DataProcessors/УстановкаВремениВключенияОтключенияРегламентныхЗаданий/Ext/ObjectModule.bsl
Функция ПроверитьЗаписьНаИзменения(вхЗапись) Экспорт
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ДанныеОВремениВключенияОтключенияРегламентныхЗаданий.РегламентноеЗадание
	|ИЗ
	|	РегистрСведений.ДанныеОВремениВключенияОтключенияРегламентныхЗаданий КАК ДанныеОВремениВключенияОтключенияРегламентныхЗаданий
	|ГДЕ
	|	ДанныеОВремениВключенияОтключенияРегламентныхЗаданий.Период = &Период
	|	И ДанныеОВремениВключенияОтключенияРегламентныхЗаданий.РегламентноеЗадание = &РегламентноеЗадание
	|	И ДанныеОВремениВключенияОтключенияРегламентныхЗаданий.ДатаОтключения = &ДатаОтключения
	|	И ДанныеОВремениВключенияОтключенияРегламентныхЗаданий.ДатаВключения = &ДатаВключения
	|	И ДанныеОВремениВключенияОтключенияРегламентныхЗаданий.Отключено <> &Отключено
	|	И ДанныеОВремениВключенияОтключенияРегламентныхЗаданий.Включено <> &Включено"
	);
	
	Запрос.УстановитьПараметр("Период", вхЗапись.Период);
	Запрос.УстановитьПараметр("РегламентноеЗадание", вхЗапись.РегламентноеЗадание);
	Запрос.УстановитьПараметр("ДатаОтключения", вхЗапись.ДатаОтключения);
	Запрос.УстановитьПараметр("ДатаВключения", вхЗапись.ДатаВключения);
	Запрос.УстановитьПараметр("Отключено", вхЗапись.Отключено);
	Запрос.УстановитьПараметр("Включено", вхЗапись.Включено);
	Результат = Запрос.Выполнить();
	
	Возврат Результат.Пустой();
	
КонецФункции

Процедура УдалитьЗаписьРегистра(вхОтбор) Экспорт
	НаборЗаписей = РегистрыСведений.ДанныеОВремениВключенияОтключенияРегламентныхЗаданий.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(вхОтбор.Период);
	НаборЗаписей.Отбор.РегламентноеЗадание.Установить(вхОтбор.РегламентноеЗадание);
	НаборЗаписей.Отбор.ДатаОтключения.Установить(вхОтбор.ДатаОтключения);
	НаборЗаписей.Отбор.ДатаВключения.Установить(вхОтбор.ДатаВключения);
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

Процедура ОбновитьТаблицыНаФорме() Экспорт
	АктивныеЗаписи.Очистить();
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ДанныеОВремениВключенияОтключенияРегламентныхЗаданий.Период,
	|	ДанныеОВремениВключенияОтключенияРегламентныхЗаданий.РегламентноеЗадание,
	|	ДанныеОВремениВключенияОтключенияРегламентныхЗаданий.ДатаОтключения КАК ДатаОтключения,
	|	ДанныеОВремениВключенияОтключенияРегламентныхЗаданий.ДатаВключения КАК ДатаВключения,
	|	ДанныеОВремениВключенияОтключенияРегламентныхЗаданий.АвторЗаписи,
	|	ДанныеОВремениВключенияОтключенияРегламентныхЗаданий.Отключено,
	|	ДанныеОВремениВключенияОтключенияРегламентныхЗаданий.Включено
	|ИЗ
	|	РегистрСведений.ДанныеОВремениВключенияОтключенияРегламентныхЗаданий КАК ДанныеОВремениВключенияОтключенияРегламентныхЗаданий
	|ГДЕ
	|	(НЕ ДанныеОВремениВключенияОтключенияРегламентныхЗаданий.Отключено
	|			ИЛИ НЕ ДанныеОВремениВключенияОтключенияРегламентныхЗаданий.Включено)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаОтключения,
	|	ДатаВключения"
	);
	
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(Запрос.Выполнить().Выгрузить(), АктивныеЗаписи);
	
	ПолныйСписок.Очистить();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АктивныеЗаписи.РегламентноеЗадание,
	|	АктивныеЗаписи.ДатаОтключения КАК Отключить,
	|	АктивныеЗаписи.ДатаВключения КАК Включить
	|ПОМЕСТИТЬ АктивныеЗаписи
	|ИЗ
	|	&АктивныеЗаписи КАК АктивныеЗаписи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА АктивныеЗаписи.РегламентноеЗадание ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ДобавитьЗапись,
	|	РегламентныеЗадания.Ссылка КАК РегламентноеЗадание,
	|	РегламентныеЗадания.ИдентификаторРегламентногоЗадания КАК Идентификатор,
	|	ЕСТЬNULL(АктивныеЗаписи.Отключить, ДАТАВРЕМЯ(1, 1, 1)) КАК Отключить,
	|	ЕСТЬNULL(АктивныеЗаписи.Включить, ДАТАВРЕМЯ(1, 1, 1)) КАК Включить
	|ИЗ
	|	Справочник.РегламентныеЗадания КАК РегламентныеЗадания
	|		ЛЕВОЕ СОЕДИНЕНИЕ АктивныеЗаписи КАК АктивныеЗаписи
	|		ПО РегламентныеЗадания.Ссылка = АктивныеЗаписи.РегламентноеЗадание
	|ГДЕ
	|	НЕ РегламентныеЗадания.ЭтоГруппа
	|	И НЕ РегламентныеЗадания.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	РегламентныеЗадания.Наименование";
	Запрос.УстановитьПараметр("АктивныеЗаписи", АктивныеЗаписи);
	
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(Запрос.Выполнить().Выгрузить(), ПолныйСписок);
	
	Для Каждого СтрокаЗаписи Из ПолныйСписок Цикл
		РЗ = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(СтрокаЗаписи.Идентификатор);
		СтрокаЗаписи.Используется = РЗ.Использование;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОчиститьВсеЗаписи() Экспорт
	Для Каждого СтрокаЗаписи Из АктивныеЗаписи Цикл
		Если ПроверитьЗаписьНаИзменения(СтрокаЗаписи) Тогда
			УдалитьЗаписьРегистра(СтрокаЗаписи);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ОбновитьТаблицыНаФорме();
		
КонецПроцедуры
